Тест_ЗУП_31_КОРП/src/InformationRegisters/ВакансииЧатботов/ВакансииЧатботов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВакансииЧатботов</name>
  <resources>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Чатбот</name>
    <type>
      <types>CatalogRef.Чатботы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/InformationRegisters/ВакансииЧатботов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ИспользуемыеВакансии(Чатбот) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Чатбот", Чатбот);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВакансииЧатботов.Чатбот КАК Чатбот,
		|	ВакансииЧатботов.Вакансия КАК Вакансия,
		|	ВакансииЧатботов.КраткоеНаименование КАК КраткоеНаименование,
		|	ВакансииЧатботов.Описание КАК Описание,
		|	ВакансииЧатботов.Используется КАК Используется
		|ИЗ
		|	РегистрСведений.ВакансииЧатботов КАК ВакансииЧатботов
		|ГДЕ
		|	ВакансииЧатботов.Чатбот = &Чатбот
		|	И ВакансииЧатботов.Используется = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВакансииЧатботов.Порядок";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЗаполнитьСведенияВакансии(СведенияВакансии, Вакансия, Чатбот = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("Чатбот", Чатбот);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВакансииЧатботов.Чатбот КАК Чатбот,
		|	ВакансииЧатботов.Вакансия КАК Вакансия,
		|	ВакансииЧатботов.КраткоеНаименование КАК КраткоеНаименование,
		|	ВакансииЧатботов.Описание КАК Описание,
		|	ВакансииЧатботов.Используется КАК Используется,
		|	ВакансииЧатботов.Приоритет КАК Приоритет
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВакансииЧатботов.Чатбот КАК Чатбот,
		|		ВакансииЧатботов.Вакансия КАК Вакансия,
		|		ВакансииЧатботов.КраткоеНаименование КАК КраткоеНаименование,
		|		ВакансииЧатботов.Описание КАК Описание,
		|		ВакансииЧатботов.Используется КАК Используется,
		|		ВЫБОР
		|			КОГДА ВакансииЧатботов.Чатбот = &Чатбот
		|				ТОГДА 1
		|			ИНАЧЕ 2
		|		КОНЕЦ КАК Приоритет
		|	ИЗ
		|		РегистрСведений.ВакансииЧатботов КАК ВакансииЧатботов
		|	ГДЕ
		|		ВакансииЧатботов.Вакансия = &Вакансия) КАК ВакансииЧатботов
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(СведенияВакансии, Выборка);
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецЕсли
